In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 데이터 분석 함수로 순위 출력하기 1(RANK)
" 데이터 분석 함수: 데이터 분석을 용이하기 위해서 제공하는 함수 "  
그중 rank는 순위를 출력하는 함수  

<br>
<br>

이름, 월급, 월급에 대한 순위를 출력하시오

In [2]:
%%sql

select ename, sal, 
       rank() over (order by sal desc) as 순위
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 1),
 ('SCOTT', Decimal('3000'), 2),
 ('FORD', Decimal('3000'), 2),
 ('JONES', Decimal('2975'), 4),
 ('BLAKE', Decimal('2850'), 5),
 ('CLARK', Decimal('2450'), 6),
 ('ALLEN', Decimal('1600'), 7),
 ('TURNER', Decimal('1500'), 8),
 ('MILLER', Decimal('1300'), 9),
 ('WARD', Decimal('1250'), 10),
 ('MARTIN', Decimal('1250'), 10),
 ('ADAMS', Decimal('1100'), 12),
 ('JAMES', Decimal('950'), 13),
 ('SMITH', Decimal('800'), 14)]

문제 153. 이름, 나이, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위가 나이가 높은 순서대로 순위를 출력하시오

In [3]:
%%sql

select replace( ename, case when length(ename)=3 then substr(ename, 2, 1)
                            when length(ename)=4 then substr(ename, -2, 1) 
                            when length(ename)=2 then substr(ename, -1, 1)  end, '*') as 이름,
       substr(age, 1, 1)||'*' as 나이,
       rank () over (order by age desc) as 순위
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('김*원', '4*', 1),
 ('권*원', '3*', 2),
 ('현*연', '3*', 3),
 ('김*순', '3*', 4),
 ('한*', '3*', 5),
 ('허*민', '3*', 6),
 ('성*창', '2*', 7),
 ('이*혁', '2*', 7),
 ('김*라', '2*', 7),
 ('송*미', '2*', 7),
 ('권*환', '2*', 11),
 ('김*원', '2*', 11),
 ('유*영', '2*', 11),
 ('김*민', '2*', 11),
 ('김*린', '2*', 15),
 ('이*성', '2*', 15),
 ('황*현', '2*', 15),
 ('남궁*미', '2*', 15),
 ('김*승', '2*', 15),
 ('신*종', '2*', 15),
 ('구*모', '2*', 21),
 ('허*', '2*', 21),
 ('정*희', '2*', 21),
 ('양*준', '2*', 21),
 ('장*진', '2*', 25),
 ('이*원', '2*', 25),
 ('김*비', '2*', 27),
 ('정*원', '2*', 27)]

문제 154. 직업, 이름, 월급, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;직업별로 각각 월급이 높은 순서대로  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위가 출력되게 하시오!

In [4]:
%%sql

select job, ename, sal, rank () over (partition by job
                                      order by sal desc) as 순위
    from emp
    where job is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'SCOTT', Decimal('3000'), 1),
 ('ANALYST', 'FORD', Decimal('3000'), 1),
 ('CLERK', 'MILLER', Decimal('1300'), 1),
 ('CLERK', 'ADAMS', Decimal('1100'), 2),
 ('CLERK', 'JAMES', Decimal('950'), 3),
 ('CLERK', 'SMITH', Decimal('800'), 4),
 ('MANAGER', 'JONES', Decimal('2975'), 1),
 ('MANAGER', 'BLAKE', Decimal('2850'), 2),
 ('MANAGER', 'CLARK', Decimal('2450'), 3),
 ('PRESIDENT', 'KING', Decimal('5000'), 1),
 ('SALESMAN', 'ALLEN', Decimal('1600'), 1),
 ('SALESMAN', 'TURNER', Decimal('1500'), 2),
 ('SALESMAN', 'MARTIN', Decimal('1250'), 3),
 ('SALESMAN', 'WARD', Decimal('1250'), 3)]

- partition by는 group by하고 혼동하면 안된다.
    - partition by는 데이터 분석함수에서 괄호안에 쓰는 문법으로
    - partition by job이라고 하면 직업별로 각각 파티션해서 나누겠다는 뜻
    
![image](https://user-images.githubusercontent.com/70187490/126997043-cf8301bd-5b33-4fb1-9e33-6ce3c82f8418.png)


문제 155. 부서번호, 이름, 입사일, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위가 부서별로 각각 먼저 입사한 사원순으로 순위가 부여되게 하시오

In [5]:
%%sql

select deptno as 부서번호, ename as 이름, to_char(hiredate,'YYYY-MM-DD') as 입사일,
       rank () over ( partition by deptno 
                      order by to_char(hiredate, 'YYYY-MM-DD') desc) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 'MILLER', '1982-01-11', 1),
 (10, 'KING', '1981-11-17', 2),
 (10, 'CLARK', '1981-05-09', 3),
 (20, 'ADAMS', '1983-01-15', 1),
 (20, 'SCOTT', '1982-12-22', 2),
 (20, 'FORD', '1981-12-11', 3),
 (20, 'JONES', '1981-04-01', 4),
 (20, 'SMITH', '1980-12-09', 5),
 (30, 'JAMES', '1981-12-11', 1),
 (30, 'MARTIN', '1981-09-10', 2),
 (30, 'TURNER', '1981-08-21', 3),
 (30, 'BLAKE', '1981-05-01', 4),
 (30, 'WARD', '1981-02-23', 5),
 (30, 'ALLEN', '1981-02-11', 6)]

문제 156. 통신사, 이름, 나이, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;통신사 별로 각각 나이가 높은 학생순으로   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위를 출력하시오

In [6]:
%%sql

select decode(lower(telecom),'sk', 'SKT', upper(telecom)) as 통신사, 
       replace(ename, case when length(ename)=2 then substr(ename, -1, 1)
                           when length(ename)=3 then substr(ename, -2, 1)
                           when length(ename)=4 then substr(ename, -2, 1) end, '*') as 이름,
       rank () over (partition by decode(lower(telecom),'sk', 'SKT', upper(telecom))
                     order by age desc) as 순위
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KT', '한*', 1),
 ('KT', '송*미', 2),
 ('KT', '이*혁', 2),
 ('KT', '김*라', 2),
 ('KT', '권*환', 5),
 ('KT', '김*원', 5),
 ('KT', '황*현', 7),
 ('KT', '김*린', 7),
 ('KT', '남궁*미', 7),
 ('KT', '허*', 10),
 ('KT', '정*희', 10),
 ('KT', '장*진', 12),
 ('KT', '이*원', 12),
 ('KT', '김*비', 14),
 ('LG', '김*원', 1),
 ('LG', '김*민', 2),
 ('LG', '김*승', 3),
 ('LG', '신*종', 3),
 ('SKT', '권*원', 1),
 ('SKT', '현*연', 2),
 ('SKT', '김*순', 3),
 ('SKT', '허*민', 4),
 ('SKT', '성*창', 5),
 ('SKT', '유*영', 6),
 ('SKT', '이*성', 7),
 ('SKT', '구*모', 8),
 ('SKT', '양*준', 8),
 ('SKT', '정*원', 10)]

# 데이터 분석 함수로 순위 출력하기 2(DENSE_RANK)
"조밀하게 순위를 정하겠다( 공동 1등 3명 다음 2등 )"  

<br>


문제 157. 이름, 월급, 순위를 출력하는데 dense_rank를 써서 순위가 1,2,3,4,5… 등 전부 출력되도록 하시오  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위는 월급이 높은 순서에 대한 순위

In [7]:
%%sql

select ename as 이름, sal as 월급,
       dense_rank () over (order by sal desc) as 순위
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 1),
 ('SCOTT', Decimal('3000'), 2),
 ('FORD', Decimal('3000'), 2),
 ('JONES', Decimal('2975'), 3),
 ('BLAKE', Decimal('2850'), 4),
 ('CLARK', Decimal('2450'), 5),
 ('ALLEN', Decimal('1600'), 6),
 ('TURNER', Decimal('1500'), 7),
 ('MILLER', Decimal('1300'), 8),
 ('WARD', Decimal('1250'), 9),
 ('MARTIN', Decimal('1250'), 9),
 ('ADAMS', Decimal('1100'), 10),
 ('JAMES', Decimal('950'), 11),
 ('SMITH', Decimal('800'), 12)]

문제 158. 입사한 년도(4자리), 이름, 월급, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;순위가 입사한 년도별로 각각 월급이 높은 순서대로 순위를 출력하시오!

In [8]:
%%sql

select to_char(hiredate, 'YYYY') as 입사년도, 
       ename as 이름, 
       sal as 월급,
       dense_rank () over (order by sal desc ) as 입사순번
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1981', 'KING', Decimal('5000'), 1),
 ('1982', 'SCOTT', Decimal('3000'), 2),
 ('1981', 'FORD', Decimal('3000'), 2),
 ('1981', 'JONES', Decimal('2975'), 3),
 ('1981', 'BLAKE', Decimal('2850'), 4),
 ('1981', 'CLARK', Decimal('2450'), 5),
 ('1981', 'ALLEN', Decimal('1600'), 6),
 ('1981', 'TURNER', Decimal('1500'), 7),
 ('1982', 'MILLER', Decimal('1300'), 8),
 ('1981', 'WARD', Decimal('1250'), 9),
 ('1981', 'MARTIN', Decimal('1250'), 9),
 ('1983', 'ADAMS', Decimal('1100'), 10),
 ('1981', 'JAMES', Decimal('950'), 11),
 ('1980', 'SMITH', Decimal('800'), 12)]

문제 159. 이메일 도메인, 이름, 나이, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
순위가 이메일 도메인 별로 나이가 높은 학생순으로 출력되게 하시오!

In [9]:
%%sql

select substr(email, instr(email,'@')+1, 
                                        REGEXP_INSTR(
                                                      substr(email, instr(email,'@')+2),'[.,]+', 1)) as 도메인, 

        replace(ename, case when length(ename)=2 then substr(ename, -1, 1)
                            when length(ename)=3 then substr(ename, 2, 1)
                            when length(ename)=4 then substr(ename, -2, 1) end, '*') as 이름,
    
        substr(age, 1, 1)||'*' as 나이,
        
        dense_rank () over ( partition by substr(email, instr(email,'@')+1,
                                                 REGEXP_INSTR(substr(email, instr(email,'@')+2),'[.,]+', 1)) 
                            order by age desc) "나이 순위"
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('gmail', '김*원', '4*', 1),
 ('gmail', '권*원', '3*', 2),
 ('gmail', '김*순', '3*', 3),
 ('gmail', '성*창', '2*', 4),
 ('gmail', '김*원', '2*', 5),
 ('gmail', '김*승', '2*', 6),
 ('gmail', '이*원', '2*', 7),
 ('hanmail', '허*민', '3*', 1),
 ('naver', '현*연', '3*', 1),
 ('naver', '한*', '3*', 2),
 ('naver', '이*혁', '2*', 3),
 ('naver', '김*라', '2*', 3),
 ('naver', '송*미', '2*', 3),
 ('naver', '권*환', '2*', 4),
 ('naver', '유*영', '2*', 4),
 ('naver', '김*민', '2*', 4),
 ('naver', '황*현', '2*', 5),
 ('naver', '이*성', '2*', 5),
 ('naver', '신*종', '2*', 5),
 ('naver', '김*린', '2*', 5),
 ('naver', '양*준', '2*', 6),
 ('naver', '정*희', '2*', 6),
 ('naver', '구*모', '2*', 6),
 ('naver', '허*', '2*', 6),
 ('naver', '장*진', '2*', 7),
 ('naver', '정*원', '2*', 8),
 ('naver', '김*비', '2*', 8),
 ('yahoo', '남궁*미', '2*', 1)]

![image](https://user-images.githubusercontent.com/70187490/127102029-3282a3ed-c706-4720-ab5c-0ce2be497eb4.png)

![image](https://user-images.githubusercontent.com/70187490/127105276-0b3bc42f-0fa2-46d9-b092-8217745d1688.png)

문제 160. 이름, 입사일, 순위를 출력하는데 순위가 먼저 입사한 사원순으로 순위를 부여하시오

In [10]:
%%sql

select ename as 이름, to_char(hiredate, 'YYYY-MM-DD') as 입사일, rank () over (order by hiredate) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SMITH', '1980-12-09', 1),
 ('ALLEN', '1981-02-11', 2),
 ('WARD', '1981-02-23', 3),
 ('JONES', '1981-04-01', 4),
 ('BLAKE', '1981-05-01', 5),
 ('CLARK', '1981-05-09', 6),
 ('TURNER', '1981-08-21', 7),
 ('MARTIN', '1981-09-10', 8),
 ('KING', '1981-11-17', 9),
 ('JAMES', '1981-12-11', 10),
 ('FORD', '1981-12-11', 10),
 ('MILLER', '1982-01-11', 12),
 ('SCOTT', '1982-12-22', 13),
 ('ADAMS', '1983-01-15', 14)]

문제 161. 직업, 이름, 입사일, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
순위가 직업별로 각각 먼저 입사한 사원순으로 순위를 부여하시오

In [11]:
%%sql

select job as 직업, 
       ename as 이름, 
       to_char(hiredate,'YYYY-MM-DD') as 입사일, 
       rank () over (partition by job
                     order by hiredate) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'FORD', '1981-12-11', 1),
 ('ANALYST', 'SCOTT', '1982-12-22', 2),
 ('CLERK', 'SMITH', '1980-12-09', 1),
 ('CLERK', 'JAMES', '1981-12-11', 2),
 ('CLERK', 'MILLER', '1982-01-11', 3),
 ('CLERK', 'ADAMS', '1983-01-15', 4),
 ('MANAGER', 'JONES', '1981-04-01', 1),
 ('MANAGER', 'BLAKE', '1981-05-01', 2),
 ('MANAGER', 'CLARK', '1981-05-09', 3),
 ('PRESIDENT', 'KING', '1981-11-17', 1),
 ('SALESMAN', 'ALLEN', '1981-02-11', 1),
 ('SALESMAN', 'WARD', '1981-02-23', 2),
 ('SALESMAN', 'TURNER', '1981-08-21', 3),
 ('SALESMAN', 'MARTIN', '1981-09-10', 4)]

문제 162. 이름, 월급, 순위를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
순위가 월급이 높은 순서대로 순위를 부여하시오!

In [12]:
%%sql

select ename as 이름, 
       sal as 월급, 
       dense_rank () over (order by sal desc) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 1),
 ('SCOTT', Decimal('3000'), 2),
 ('FORD', Decimal('3000'), 2),
 ('JONES', Decimal('2975'), 3),
 ('BLAKE', Decimal('2850'), 4),
 ('CLARK', Decimal('2450'), 5),
 ('ALLEN', Decimal('1600'), 6),
 ('TURNER', Decimal('1500'), 7),
 ('MILLER', Decimal('1300'), 8),
 ('WARD', Decimal('1250'), 9),
 ('MARTIN', Decimal('1250'), 9),
 ('ADAMS', Decimal('1100'), 10),
 ('JAMES', Decimal('950'), 11),
 ('SMITH', Decimal('800'), 12)]

문제 163. 월급이 2975는 순위가 몇위인가?

In [13]:
%%sql

select dense_rank(2975) within group (order by sal desc) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(3,)]

문제 164. 우리반에서 34 나이의 순위를 출력하시오

In [14]:
%%sql

select dense_rank(34) within group (order by age desc) as 순위
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(4,)]

문제 165. 81년 11월 17일에 입사한 사원은  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
사원 테이블에서 몇번째로 입사한 사원인가?

In [15]:
%%sql

select dense_rank(to_date('1981-11-17','YYYY-MM-DD')) 
                  within group (order by hiredate asc) as 순위
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(9,)]

# 데이터 분석 함수로 등급 출력하기(NTILE)
" 등급을 출력하는 함수 "  
--> 제조업에서 많이 쓰이는 함수

In [16]:
%%sql

select ename, sal, ntile(4) over (order by sal desc) as 등급
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 1),
 ('SCOTT', Decimal('3000'), 1),
 ('FORD', Decimal('3000'), 1),
 ('JONES', Decimal('2975'), 1),
 ('BLAKE', Decimal('2850'), 2),
 ('CLARK', Decimal('2450'), 2),
 ('ALLEN', Decimal('1600'), 2),
 ('TURNER', Decimal('1500'), 2),
 ('MILLER', Decimal('1300'), 3),
 ('WARD', Decimal('1250'), 3),
 ('MARTIN', Decimal('1250'), 3),
 ('ADAMS', Decimal('1100'), 4),
 ('JAMES', Decimal('950'), 4),
 ('SMITH', Decimal('800'), 4)]

※ 월급이 높은 순으로 정렬한 데이터를 4등급으로 나누겠다.
- 0 ~ 25% 1등급
- 25 ~ 50% 2등급
- 50 ~ 75% 3등급
- 75 ~ 100% 4등급

문제 166. 이름, 나이, 등급을 출력하는데 등급을 7등급으로 나눠서 출력하시오  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;나이가 높은 순서대로 등급을 나누시오

In [17]:
%%sql

select replace(ename, case when length(ename) = 4 then substr(ename, -2, 1)
                           when length(ename) = 3 then substr(ename, 2, 1) 
                           else substr(ename, -1, 1) end, '*')             as 이름,
        substr(age, 1, 1)||'*'   as 나이,
        ntile(7) over (order by age desc) as "나이 등급"
        
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('김*원', '4*', 1),
 ('권*원', '3*', 1),
 ('현*연', '3*', 1),
 ('김*순', '3*', 1),
 ('한*', '3*', 2),
 ('허*민', '3*', 2),
 ('성*창', '2*', 2),
 ('이*혁', '2*', 2),
 ('김*라', '2*', 3),
 ('송*미', '2*', 3),
 ('권*환', '2*', 3),
 ('김*원', '2*', 3),
 ('유*영', '2*', 4),
 ('김*민', '2*', 4),
 ('김*린', '2*', 4),
 ('이*성', '2*', 4),
 ('황*현', '2*', 5),
 ('남궁*미', '2*', 5),
 ('김*승', '2*', 5),
 ('신*종', '2*', 5),
 ('구*모', '2*', 6),
 ('허*', '2*', 6),
 ('정*희', '2*', 6),
 ('양*준', '2*', 6),
 ('장*진', '2*', 7),
 ('이*원', '2*', 7),
 ('김*비', '2*', 7),
 ('정*원', '2*', 7)]

문제 167. 직업, 이름, 월급, 등급을 출력하는데 직업별 각각 등급이   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3등급으로 나눠지게 하시오  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(등급은 월급이 높은 순서대로의 등급입니다.)

In [18]:
%%sql

 select job, ename, sal,
        ntile(3) over(partition by job order by sal) as "직업별 월급 등급"
        from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'FORD', Decimal('3000'), 1),
 ('ANALYST', 'SCOTT', Decimal('3000'), 2),
 ('CLERK', 'SMITH', Decimal('800'), 1),
 ('CLERK', 'JAMES', Decimal('950'), 1),
 ('CLERK', 'ADAMS', Decimal('1100'), 2),
 ('CLERK', 'MILLER', Decimal('1300'), 3),
 ('MANAGER', 'CLARK', Decimal('2450'), 1),
 ('MANAGER', 'BLAKE', Decimal('2850'), 2),
 ('MANAGER', 'JONES', Decimal('2975'), 3),
 ('PRESIDENT', 'KING', Decimal('5000'), 1),
 ('SALESMAN', 'WARD', Decimal('1250'), 1),
 ('SALESMAN', 'MARTIN', Decimal('1250'), 1),
 ('SALESMAN', 'TURNER', Decimal('1500'), 2),
 ('SALESMAN', 'ALLEN', Decimal('1600'), 3)]

# 데이터 분석 함수로 순위의 비율 출력하기(CUME_DIST)

In [19]:
%%sql

select ename, sal, 
       cume_dist( ) over(order by sal desc) 비율
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), Decimal('0.0714285714285714285714285714285714285714')),
 ('SCOTT', Decimal('3000'), Decimal('0.2142857142857142857142857142857142857143')),
 ('FORD', Decimal('3000'), Decimal('0.2142857142857142857142857142857142857143')),
 ('JONES', Decimal('2975'), Decimal('0.2857142857142857142857142857142857142857')),
 ('BLAKE', Decimal('2850'), Decimal('0.3571428571428571428571428571428571428571')),
 ('CLARK', Decimal('2450'), Decimal('0.4285714285714285714285714285714285714286')),
 ('ALLEN', Decimal('1600'), Decimal('0.5')),
 ('TURNER', Decimal('1500'), Decimal('0.5714285714285714285714285714285714285714')),
 ('MILLER', Decimal('1300'), Decimal('0.6428571428571428571428571428571428571429')),
 ('WARD', Decimal('1250'), Decimal('0.7857142857142857142857142857142857142857')),
 ('MARTIN', Decimal('1250'), Decimal('0.7857142857142857142857142857142857142857')),
 ('ADAMS', Decimal('1100'), Decimal('0.8571428571428571428571428571428571428571')),
 ('JAMES', Decimal('950'), Decimal('0.9285714285714285714285714285714285714286')),
 ('SMITH', Decimal('800'), 1)]

문제 168. 위의 결과에서 소수점 세번째까지만 출력되게 반올림하시오

In [20]:
%%sql

select ename, sal,
       round(cume_dist() over(order by sal desc),3) 비율
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), Decimal('0.071')),
 ('SCOTT', Decimal('3000'), Decimal('0.214')),
 ('FORD', Decimal('3000'), Decimal('0.214')),
 ('JONES', Decimal('2975'), Decimal('0.286')),
 ('BLAKE', Decimal('2850'), Decimal('0.357')),
 ('CLARK', Decimal('2450'), Decimal('0.429')),
 ('ALLEN', Decimal('1600'), Decimal('0.5')),
 ('TURNER', Decimal('1500'), Decimal('0.571')),
 ('MILLER', Decimal('1300'), Decimal('0.643')),
 ('WARD', Decimal('1250'), Decimal('0.786')),
 ('MARTIN', Decimal('1250'), Decimal('0.786')),
 ('ADAMS', Decimal('1100'), Decimal('0.857')),
 ('JAMES', Decimal('950'), Decimal('0.929')),
 ('SMITH', Decimal('800'), 1)]

# 데이터 분석 함수로 데이터를 가로로 출력하기( ListAGG )
"데이터를 가로로 출력하는 함수"_중요함
![image](https://user-images.githubusercontent.com/70187490/127760315-bd632686-e1d8-4bde-b455-90b809b8ed70.png)

- 이름을 가로로 출력하는데 콤마(,)로 구분해서 출력하겠다.
- 이름이 ABCD 순으로 정렬되어 출력하고 싶다
- listagg는 다른 분석함수와 다르게 group by가 필요하다.

In [21]:
%%sql

select deptno,
       listagg(ename, ', ') within group (order by ename asc) 이름
    from emp
    group by deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 'CLARK, KING, MILLER'),
 (20, 'ADAMS, FORD, JONES, SCOTT, SMITH'),
 (30, 'ALLEN, BLAKE, JAMES, MARTIN, TURNER, WARD')]


문제 169. 직업, 직업별로 해당하는 사원들의 이름을 가로로 출력하시오

In [22]:
%%sql

select job 직업, 
       listagg(ename, ', ') within group (order by ename asc) 이름
    from emp
    where job is not null
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'FORD, SCOTT'),
 ('CLERK', 'ADAMS, JAMES, MILLER, SMITH'),
 ('MANAGER', 'BLAKE, CLARK, JONES'),
 ('PRESIDENT', 'KING'),
 ('SALESMAN', 'ALLEN, MARTIN, TURNER, WARD')]

문제 170. 아래와 같이 결과를 출력하시오
![image](https://user-images.githubusercontent.com/70187490/127760536-1682a9b6-d988-45f4-86f5-6961ef34a944.png)

In [23]:
%%sql

select job as 직업, 
       listagg(ename||'('||sal||')',', ') within group (order by job asc) as 이름
    from emp
    where job is not null
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'FORD(3000), SCOTT(3000)'),
 ('CLERK', 'ADAMS(1100), JAMES(950), MILLER(1300), SMITH(800)'),
 ('MANAGER', 'BLAKE(2850), CLARK(2450), JONES(2975)'),
 ('PRESIDENT', 'KING(5000)'),
 ('SALESMAN', 'ALLEN(1600), MARTIN(1250), TURNER(1500), WARD(1250)')]

문제 171. 나이, 나이별로 해당하는 학생들의 이름을 가로로 출력하시오

In [24]:
%%sql

select substr(age, 1, 1)||'*' as 나이,
       listagg(
               replace(ename, case when length(ename) = 4 then substr(ename, -2, 1)
                                   when length(ename) = 3 then substr(ename, 2, 1) 
                                   else substr(ename, -1, 1) end, '*'),
                                                                                       ' ,') within group (order by age desc)
                                                                                       as 이름
    from emp12
    group by age

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('2*', '김*비 ,정*원'),
 ('2*', '이*원 ,장*진'),
 ('2*', '구*모 ,양*준 ,정*희 ,허*'),
 ('2*', '김*린 ,김*승 ,남궁*미 ,신*종 ,이*성 ,황*현'),
 ('2*', '권*환 ,김*민 ,김*원 ,유*영'),
 ('2*', '김*라 ,성*창 ,송*미 ,이*혁'),
 ('3*', '허*민'),
 ('3*', '한*'),
 ('3*', '김*순'),
 ('3*', '현*연'),
 ('3*', '권*원'),
 ('4*', '김*원')]

%%sql

Update emp12  
  set telecom = 'sk'  
  where telecom in ('skt', 'SK')  
    
  commit

# 데이터 분석 함수로 바로 전 행과 다음 행 출력하기(LAG, LEAD)
"바로 전행을 옆에 나오게 하거나 바로 다음행을 옆에 나오게 할 때 사용하는 함수"  
--> 차이를 쉽게 알 수 있기에 금융권에서 많이 쓰임

In [25]:
%%sql

select ename, sal, lag(sal, 1) over ( order by sal asc ) as 전행,
                   lead(sal,1) over ( order by sal asc ) as 다음행
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SMITH', Decimal('800'), None, 950),
 ('JAMES', Decimal('950'), 800, 1100),
 ('ADAMS', Decimal('1100'), 950, 1250),
 ('WARD', Decimal('1250'), 1100, 1250),
 ('MARTIN', Decimal('1250'), 1250, 1300),
 ('MILLER', Decimal('1300'), 1250, 1500),
 ('TURNER', Decimal('1500'), 1300, 1600),
 ('ALLEN', Decimal('1600'), 1500, 2450),
 ('CLARK', Decimal('2450'), 1600, 2850),
 ('BLAKE', Decimal('2850'), 2450, 2975),
 ('JONES', Decimal('2975'), 2850, 3000),
 ('FORD', Decimal('3000'), 2975, 3000),
 ('SCOTT', Decimal('3000'), 3000, 5000),
 ('KING', Decimal('5000'), 3000, None)]

문제 173. 이름, 입사일, 바로 전에 입사한 사원의 입사일  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
바로 다음에 입사한 사원의 입사일을 출력하시오

In [26]:
%%sql

select ename, to_char(hiredate,'YYYY-MM-DD') as 날짜,
       lag(to_char(hiredate,'YYYY-MM-DD'), 1) over ( order by hiredate ) as 전행
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SMITH', '1980-12-09', None),
 ('ALLEN', '1981-02-11', '1980-12-09'),
 ('WARD', '1981-02-23', '1981-02-11'),
 ('JONES', '1981-04-01', '1981-02-23'),
 ('BLAKE', '1981-05-01', '1981-04-01'),
 ('CLARK', '1981-05-09', '1981-05-01'),
 ('TURNER', '1981-08-21', '1981-05-09'),
 ('MARTIN', '1981-09-10', '1981-08-21'),
 ('KING', '1981-11-17', '1981-09-10'),
 ('JAMES', '1981-12-11', '1981-11-17'),
 ('FORD', '1981-12-11', '1981-12-11'),
 ('MILLER', '1982-01-11', '1981-12-11'),
 ('SCOTT', '1982-12-22', '1982-01-11'),
 ('ADAMS', '1983-01-15', '1982-12-22')]

# COLUMN을 ROW로 출력하기 1(SUM+DECODE)

Ex1) 부서번호, 부서번호별 토탈월급을 출력하시오 (세로출력)

In [27]:
%%sql

select deptno,
       sum(sal)
    from emp
    group by deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(30, 9400), (10, 8750), (20, 10875)]

Ex2) 부서번호, 부서번호별 토탈월급을 출력하시오 (가로출력)  
<br>
2-1) 부서번호, 부서번호가 10번이면 월급이 출력되게 하고
       아니면 0이 출력되게 하시오

In [28]:
%%sql

select deptno, 
       decode( deptno, 10, sal, 0)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 5000),
 (30, 0),
 (10, 2450),
 (20, 0),
 (30, 0),
 (30, 0),
 (30, 0),
 (30, 0),
 (30, 0),
 (20, 0),
 (20, 0),
 (20, 0),
 (20, 0),
 (10, 1300)]

2-2) 위의 결과에서 부서번호 컬럼은 안나오게 하세오

In [29]:
%%sql

select decode(deptno, 10, sal, 0)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(5000,),
 (0,),
 (2450,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (1300,)]

2-3) 위에서 출력된 14개의 데이터를 다 sum하시오!

In [30]:
%%sql

select sum(decode(deptno, 10, sal, 0))
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(8750,)]

2-4) 위의 컬럼명을 컬럼 별칭을 써서 숫자 10으로 변경하시오

In [31]:
%%sql

select sum(decode(deptno, 10, sal, 0)) as "10"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(8750,)]

2-5) 위와 같이 20번과 30번도 같이 출력하시오

In [32]:
%%sql

select 
    sum(decode(deptno, 10, sal, 0)) as "10",
    sum(decode(deptno, 20, sal, 0)) as "20",
    sum(decode(deptno, 30, sal, 0)) as "30"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(8750, 10875, 9400)]

문제 174. 통신사, 통신사별 토탈나이를 출력하시오(세로출력)

In [33]:
%%sql

select telecom, sum(age)
    from emp12
    group by telecom

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('sk', 294), ('lg', 126), ('kt', 381)]

문제 175. 이번에는 아래와 같이 가로로 출력하시오

In [34]:
%%sql

select sum(decode(telecom, 'sk', age)) as sk,
       sum(decode(telecom, 'kt', age)) as kt,
       sum(decode(telecom, 'lg', age)) as lg
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(294, 381, 126)]

문제 178. 직업, 직업별 토탈월급을 출력하시오(세로로 출력)

In [35]:
%%sql

select job, sum(sal)
    from emp
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 5600),
 ('CLERK', 4150),
 ('ANALYST', 6000),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000)]

문제 179. 직업, 직업별 토탈월급을 출력하시오(가로로 출력)

In [36]:
%%sql

select sum(decode(job,'SALESMAN',sal)) as "SALESMAN",
       sum(decode(job, 'CLERK', sal)) as "CLERK",
       sum(decode(job, 'ANALYST', sal)) as "ANALYST",
       sum(decode(job, 'MANAGER', sal)) as "MANAGER",
       sum(decode(job, 'PRESIDENT', sal)) as "PRESIDENT"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(5600, 4150, 6000, 8275, 5000)]

#  COLUMN을 ROW로 출력하기 2(PIVOT)
" 세로를 가로로 출력하는 함수 "

In [37]:
%%sql

select *
    from (select deptno, sal from emp)
    pivot (sum(sal) for deptno in (10, 20, 30))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(8750, 10875, 9400)]

![image](https://user-images.githubusercontent.com/70187490/127954269-629d74d1-79e5-4aef-bce2-fdf9da2393a3.png)
문제 180. 통신사, 통신사별 토탈나이를 가로로 출력하시오(pivot문으로)

In [38]:
%%sql

select *
    from (select telecom, age from emp12)
    pivot (sum(age) for telecom in ('sk','lg','kt'))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(294, 126, 381)]

문제 181. 위의 결과를 토탈나이가 아니라 평균나이로 나오게 하시오

In [39]:
%%sql

select * 
    
    from ( select telecom, 
                  round(avg(age),1) as "나이" 
              from emp12 group by telecom )
    
    pivot (max(나이) for telecom in ('sk', 'kt','lg'))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(Decimal('29.4'), Decimal('27.2'), Decimal('31.5'))]

# 데이터 분석 함수로 누적 데이터 출력하기(SUM OVER)
" 데이터를 누적해서 합계하는 데이터 분석 함수 "  
Ex) 사원번호, 이름, 월급, 월급의 누적치를 출력하시오!

In [40]:
%%sql

select empno, ename, sal, sum(sal) over (order by empno asc) 누적치
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(7369, 'SMITH', Decimal('800'), 800),
 (7499, 'ALLEN', Decimal('1600'), 2400),
 (7521, 'WARD', Decimal('1250'), 3650),
 (7566, 'JONES', Decimal('2975'), 6625),
 (7654, 'MARTIN', Decimal('1250'), 7875),
 (7698, 'BLAKE', Decimal('2850'), 10725),
 (7782, 'CLARK', Decimal('2450'), 13175),
 (7788, 'SCOTT', Decimal('3000'), 16175),
 (7839, 'KING', Decimal('5000'), 21175),
 (7844, 'TURNER', Decimal('1500'), 22675),
 (7876, 'ADAMS', Decimal('1100'), 23775),
 (7900, 'JAMES', Decimal('950'), 24725),
 (7902, 'FORD', Decimal('3000'), 27725),
 (7934, 'MILLER', Decimal('1300'), 29025)]

문제 182. 이름, 나이, 나이의 누적치를 출력하시오

In [41]:
%%sql

select replace(ename, 
                       substr(ename, 
                                  decode( length(ename), 4, 3, 2 ), 1)
                                                                       ,'*') as "이름",
       substr(age, 1, 1)||'*' as "나이",
       substr(sum(age) over (order by age asc),
              decode(length(sum(age) over (order by age asc)), 3, 1, 0),
              decode(length(sum(age) over (order by age asc)), 3, 2, 1)) ||'*' as "누적치"
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('김*비', '2*', '4*'),
 ('정*원', '2*', '4*'),
 ('장*진', '2*', '9*'),
 ('이*원', '2*', '9*'),
 ('허*', '2*', '20*'),
 ('정*희', '2*', '20*'),
 ('구*모', '2*', '20*'),
 ('양*준', '2*', '20*'),
 ('이*성', '2*', '36*'),
 ('김*승', '2*', '36*'),
 ('신*종', '2*', '36*'),
 ('황*현', '2*', '36*'),
 ('김*린', '2*', '36*'),
 ('남궁*미', '2*', '36*'),
 ('김*원', '2*', '47*'),
 ('김*민', '2*', '47*'),
 ('유*영', '2*', '47*'),
 ('권*환', '2*', '47*'),
 ('송*미', '2*', '59*'),
 ('성*창', '2*', '59*'),
 ('이*혁', '2*', '59*'),
 ('김*라', '2*', '59*'),
 ('허*민', '3*', '62*'),
 ('한*', '3*', '65*'),
 ('김*순', '3*', '68*'),
 ('현*연', '3*', '72*'),
 ('권*원', '3*', '75*'),
 ('김*원', '4*', '80*')]

문제 183. 직업, 이름, 월급, 월급의 누적치를 출력하는데   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;직업별로 각각 월급의 누적치가 출력되게 하시오

In [42]:
%%sql

select job as 직업, ename as 이름, sal as 월급,
       sum(sal) over (partition by job order by sal asc) as 누적치
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 'FORD', Decimal('3000'), 6000),
 ('ANALYST', 'SCOTT', Decimal('3000'), 6000),
 ('CLERK', 'SMITH', Decimal('800'), 800),
 ('CLERK', 'JAMES', Decimal('950'), 1750),
 ('CLERK', 'ADAMS', Decimal('1100'), 2850),
 ('CLERK', 'MILLER', Decimal('1300'), 4150),
 ('MANAGER', 'CLARK', Decimal('2450'), 2450),
 ('MANAGER', 'BLAKE', Decimal('2850'), 5300),
 ('MANAGER', 'JONES', Decimal('2975'), 8275),
 ('PRESIDENT', 'KING', Decimal('5000'), 5000),
 ('SALESMAN', 'WARD', Decimal('1250'), 2500),
 ('SALESMAN', 'MARTIN', Decimal('1250'), 2500),
 ('SALESMAN', 'TURNER', Decimal('1500'), 4000),
 ('SALESMAN', 'ALLEN', Decimal('1600'), 5600)]

문제 184. 통신사, 이름, 나이, 나이 누적치를 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;나이의 누적치가 통신사별로 각각 누적되어 출력되게하시오

In [43]:
%%sql

select telecom as 통신사,
       replace(ename, 
                       substr(ename, 
                                  decode( length(ename), 4, 3, 2 ), 1)
                                                                       ,'*') as 이름,
       substr(age, 1, 1)||'*' as 나이,
       substr(sum(age) over (partition by telecom order by age asc),
              decode(length(sum(age) over (partition by telecom order by age asc)), 3, 1, 0),
              decode(length(sum(age) over (partition by telecom order by age asc)), 3, 2, 1)) ||'*' as 누적치
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('kt', '김*비', '2*', '2*'),
 ('kt', '이*원', '2*', '7*'),
 ('kt', '장*진', '2*', '7*'),
 ('kt', '허*', '2*', '12*'),
 ('kt', '정*희', '2*', '12*'),
 ('kt', '김*린', '2*', '20*'),
 ('kt', '남궁*미', '2*', '20*'),
 ('kt', '황*현', '2*', '20*'),
 ('kt', '김*원', '2*', '26*'),
 ('kt', '권*환', '2*', '26*'),
 ('kt', '송*미', '2*', '35*'),
 ('kt', '이*혁', '2*', '35*'),
 ('kt', '김*라', '2*', '35*'),
 ('kt', '한*', '3*', '38*'),
 ('lg', '김*승', '2*', '5*'),
 ('lg', '신*종', '2*', '5*'),
 ('lg', '김*민', '2*', '8*'),
 ('lg', '김*원', '4*', '12*'),
 ('sk', '정*원', '2*', '2*'),
 ('sk', '구*모', '2*', '7*'),
 ('sk', '양*준', '2*', '7*'),
 ('sk', '이*성', '2*', '10*'),
 ('sk', '유*영', '2*', '13*'),
 ('sk', '성*창', '2*', '16*'),
 ('sk', '허*민', '3*', '19*'),
 ('sk', '김*순', '3*', '22*'),
 ('sk', '현*연', '3*', '25*'),
 ('sk', '권*원', '3*', '29*')]

# 데이터 분석 함수로 비율 출력하기(RATIO_TO_REPORT)
"자기의 월급이 전 월급 중에서의 비율이 어떻게 되는지 확인하는 함수"

In [44]:
%%sql

select ename, sal, round(ratio_to_report(sal) over (), 2) as 비율
    from emp
    where job='SALESMAN'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', Decimal('1250'), Decimal('0.22')),
 ('ALLEN', Decimal('1600'), Decimal('0.29')),
 ('TURNER', Decimal('1500'), Decimal('0.27')),
 ('WARD', Decimal('1250'), Decimal('0.22'))]

# 데이터 분석 함수로 집계 결과 출력하기 1(ROLLUP)
"집계한 결과를 맨 아래쪽에 출력하고 싶을 때 사용하는 함수"  
ex) 부서번호, 부서번호 별 토탈월급을 출력하시오(세로 출력)

In [45]:
%%sql

select deptno, sum(sal)
    from emp
    group by rollup(deptno)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 8750), (20, 10875), (30, 9400), (None, 29025)]

Ex) 직업, 직업별 토탈월급을 출력하시오(세로 출력)

In [46]:
%%sql

select job, sum(sal)
    from emp
    group by rollup(job)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 6000),
 ('CLERK', 4150),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000),
 ('SALESMAN', 5600),
 (None, 29025)]

# 데이터 분석 함수로 집계 결과 출력하기 2(CUBE)
" 집계 결과를 위쪽에 출력하는 함수 "

In [47]:
%%sql

select decode(job,null,'합계',job) as 직업, sum(sal) as "합계 월급"
    from emp
    group by cube(job)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('합계', 29025),
 ('CLERK', 4150),
 ('ANALYST', 6000),
 ('MANAGER', 8275),
 ('SALESMAN', 5600),
 ('PRESIDENT', 5000)]

문제 185. 통신사, 통신사별 토탈나이를 출력하는데 맨위에 전체 토탈나이가 출력되게 하시오

In [48]:
%%sql

select decode(telecom, null, '총 나이', telecom) as 통신사, sum(age) as "합계 나이"
    from emp12
    group by cube(telecom)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('총 나이', 801), ('kt', 381), ('lg', 126), ('sk', 294)]

문제 186. 입사한 년도(4자리), 입사한 년도별 토탈 월급을 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
맨위에 전체 토탈월급을 출력하시오!

In [49]:
%%sql

select decode(to_char(hiredate, 'YYYY'), null, '합계 임금', to_char(hiredate, 'YYYY')) as 연도별,
       sum(sal) as "총 월급"
    from emp
    group by cube(to_char(hiredate, 'YYYY'))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('합계 임금', 29025),
 ('1980', 800),
 ('1981', 22825),
 ('1982', 4300),
 ('1983', 1100)]

문제 187. 입사한 년도(4자리), 입사한 년도별 토탈월급을 출력하시오! <가로 출력>

In [50]:
%%sql

select sum(decode(to_char(hiredate, 'YYYY'), 1980, sal)) as "1980년",
       sum(decode(to_char(hiredate, 'YYYY'), 1981, sal)) as "1981년", 
       sum(decode(to_char(hiredate, 'YYYY'), 1982, sal)) as "1982년",
       sum(decode(to_char(hiredate, 'YYYY'), 1983, sal)) as "1983년"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(800, 22825, 4300, 1100)]

문제188.   직업, 직업별 토탈월급을 출력하시오 !

In [51]:
%%sql

select job, sum(sal)
    from emp
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 5600),
 ('CLERK', 4150),
 ('ANALYST', 6000),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000)]

문제189.  그러면 위의 결과를 다시 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
맨 아래에 전체 토탈월급이 출력되게하시오 !

In [52]:
%%sql

select decode(job, null, 'Total Sal', job) as job , sum(sal)
    from emp
    group by cube(job)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('Total Sal', 29025),
 ('CLERK', 4150),
 ('ANALYST', 6000),
 ('MANAGER', 8275),
 ('SALESMAN', 5600),
 ('PRESIDENT', 5000)]

문제190. 아래에 job 맨아에 null 로 나오는 부분에 토탈값: 이라고 한글로  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;null 대신에 출력되게하시오 !

In [53]:
%%sql

select nvl(job, '토탈값:'), sum(sal)
    from emp
    group by rollup(job)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 6000),
 ('CLERK', 4150),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000),
 ('SALESMAN', 5600),
 ('토탈값:', 29025)]

문제191. 위의 결과를 다시 출력하는데 컬럼명이 같이 출력되게 하시오 !

In [54]:
%%sql

select nvl(job, '토탈값:') as job, sum(sal)
    from emp
    group by rollup(job)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 6000),
 ('CLERK', 4150),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000),
 ('SALESMAN', 5600),
 ('토탈값:', 29025)]

문제192.  위의 결과를 다시 출력하는데 아래와 같이 토탈월급 부분에  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;천단위를 부여하시오 !

In [55]:
%%sql

select nvl(job, '토탈값') as job, to_char(sum(sal), '999,999') as "Total Sal"
    from emp
    group by rollup(job)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', '   6,000'),
 ('CLERK', '   4,150'),
 ('MANAGER', '   8,275'),
 ('PRESIDENT', '   5,000'),
 ('SALESMAN', '   5,600'),
 ('토탈값', '  29,025')]

# 데이터 분석 함수로 집계 결과 출력하기 3(GROUPING SETS)
"집계결과를 출력하는 데이터 분석 함수"

In [58]:
%%sql

select deptno, sum(sal)
    from emp
    group by grouping sets (deptno, () )

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 8750), (20, 10875), (30, 9400), (None, 29025)]

문제193. 직업, 직업별 토탈월급을 출력하는데 맨 아래에 전체 토탈월급이  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
출력되게 하시오 ! (grouping sets 를 이용해서 수행)

In [77]:
%%sql

select job, sum(sal)
    from emp
    group by grouping sets(job, ())

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ANALYST', 6000),
 ('CLERK', 4150),
 ('MANAGER', 8275),
 ('PRESIDENT', 5000),
 ('SALESMAN', 5600),
 (None, 29025)]

문제194. 부서번호와 직업을 출력하고 그 옆에 부서번호별 직업별   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
토탈월급을 출력하시오 !

In [82]:
%%sql

select deptno, job, sum(sal)
    from emp
    group by deptno, job
    order by deptno, job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 'CLERK', 1300),
 (10, 'MANAGER', 2450),
 (10, 'PRESIDENT', 5000),
 (20, 'ANALYST', 6000),
 (20, 'CLERK', 1900),
 (20, 'MANAGER', 2975),
 (30, 'CLERK', 950),
 (30, 'MANAGER', 2850),
 (30, 'SALESMAN', 5600)]

문제195. 부서번호와 직업을 출력하고 그 옆에 부서번호별 직업별 토탈월급을 출력하고  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;동시에 부서번호별 토탈월급도 중간중간 출력되게
            하시오 !

In [87]:
%%sql

select deptno, job, sum(sal)
    from emp
    group by grouping sets ((deptno, job), deptno)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 'CLERK', 1300),
 (10, 'MANAGER', 2450),
 (10, 'PRESIDENT', 5000),
 (10, None, 8750),
 (20, 'CLERK', 1900),
 (20, 'ANALYST', 6000),
 (20, 'MANAGER', 2975),
 (20, None, 10875),
 (30, 'CLERK', 950),
 (30, 'MANAGER', 2850),
 (30, 'SALESMAN', 5600),
 (30, None, 9400)]

문제196.  위의 결과의 맨 아래에 전체 토탈월급이 출력되게하시오 !

In [90]:
%%sql

select deptno, job, sum(sal)
    from emp
    group by grouping sets ((deptno, job), deptno, ())

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 'CLERK', 1300),
 (10, 'MANAGER', 2450),
 (10, 'PRESIDENT', 5000),
 (10, None, 8750),
 (20, 'CLERK', 1900),
 (20, 'ANALYST', 6000),
 (20, 'MANAGER', 2975),
 (20, None, 10875),
 (30, 'CLERK', 950),
 (30, 'MANAGER', 2850),
 (30, 'SALESMAN', 5600),
 (30, None, 9400),
 (None, None, 29025)]

문제197. 사원번호,  사원 이름, 월급을 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
맨 아래에 전체토탈월급을
출력하시오 !

In [96]:
%%sql

select empno, ename, sum(sal)
    from emp
    group by grouping sets ((empno, ename), ())
    order by empno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(7369, 'SMITH', 800),
 (7499, 'ALLEN', 1600),
 (7521, 'WARD', 1250),
 (7566, 'JONES', 2975),
 (7654, 'MARTIN', 1250),
 (7698, 'BLAKE', 2850),
 (7782, 'CLARK', 2450),
 (7788, 'SCOTT', 3000),
 (7839, 'KING', 5000),
 (7844, 'TURNER', 1500),
 (7876, 'ADAMS', 1100),
 (7900, 'JAMES', 950),
 (7902, 'FORD', 3000),
 (7934, 'MILLER', 1300),
 (None, None, 29025)]

- 사원번호는 중복되지 않기때문에 grouping sets 함수에 괄호안에 grouping 결과로 넣어도 그냥 자기 월급이 출력된다.
- 왜냐하면 딱 한건만 있기 때문에! ( 그 한 건을 집계해봐야 그 값이 된다. )
- 그래서 자신 있게 (empno, ename)이라고 적을 수 있다
- 그리고 맨끝에 ( )은 전체 토탈월급을 출력하는 것
  
그룹함수와 grouping sets 는 서로 짝꿍이어서 grouping sets 를 썼는데
  select 절에 group 함수를 안쓰면 안된다.

문제198.  우리반 테이블에서 통신사, 이름, 나이를 출력하는데   
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
중간중간 통신사별 토탈나이가 출력되게하시오 !

In [130]:
%%sql

select telecom as 통신사, 
       replace(ename, 
                       substr(ename, 
                                  decode( length(ename), 4, 3, 2 ), 1)
                                                                       ,'*') as 이름,
       '*'||substr(sum(age), 2, 2) as 나이
    from emp12
    group by grouping sets ((telecom, ename), (telecom))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('kt', '한*', '*1'),
 ('kt', '허*', '*6'),
 ('kt', '권*환', '*8'),
 ('kt', '김*라', '*9'),
 ('kt', '김*린', '*7'),
 ('kt', '김*원', '*8'),
 ('kt', '김*비', '*4'),
 ('kt', '송*미', '*9'),
 ('kt', '이*원', '*5'),
 ('kt', '이*혁', '*9'),
 ('kt', '장*진', '*5'),
 ('kt', '정*희', '*6'),
 ('kt', '황*현', '*7'),
 ('kt', '남궁*미', '*7'),
 ('kt', None, '*81'),
 ('lg', '김*승', '*7'),
 ('lg', '김*민', '*8'),
 ('lg', '김*원', '*4'),
 ('lg', '신*종', '*7'),
 ('lg', None, '*26'),
 ('sk', '구*모', '*6'),
 ('sk', '권*원', '*6'),
 ('sk', '김*순', '*3'),
 ('sk', '성*창', '*9'),
 ('sk', '양*준', '*6'),
 ('sk', '유*영', '*8'),
 ('sk', '이*성', '*7'),
 ('sk', '정*원', '*4'),
 ('sk', '허*민', '*0'),
 ('sk', '현*연', '*5'),
 ('sk', None, '*94')]

문제199. 입사한 년도(4자리), 입사한 년도별 토탈월급을 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;전체 토탈월급이 맨 아래에 출력되게 하시오

In [117]:
%%sql

select to_char(hiredate, 'YYYY'), sum(sal)
    from emp
    group by grouping sets (to_char(hiredate, 'YYYY'), ())

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1980', 800), ('1981', 22825), ('1982', 4300), ('1983', 1100), (None, 29025)]

In [120]:
%%sql

select to_char(hiredate, 'YYYY'), sum(sal)
    from emp
    group by rollup(to_char(hiredate, 'YYYY'))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1980', 800), ('1981', 22825), ('1982', 4300), ('1983', 1100), (None, 29025)]

문제 200. 위의 결과를 다시 출력하는데 아래와 같이 천단위를 부여해서 출력하시오

In [121]:
%%sql

select to_char(hiredate, 'YYYY'), to_char(sum(sal), '999,999')
    from emp
    group by rollup(to_char(hiredate, 'YYYY'))

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1980', '     800'),
 ('1981', '  22,825'),
 ('1982', '   4,300'),
 ('1983', '   1,100'),
 (None, '  29,025')]

문제 201. 입사한 년도(4자리), 부서번호, 입사한 년도별 부서번호별 토탈월급을 출력하시오!

In [134]:
%%sql

select to_char(hiredate, 'YYYY'), deptno, sum(sal)
    from emp
    group by grouping sets( (to_char(hiredate, 'YYYY'), deptno), () )
    order by to_char(hiredate, 'YYYY'), deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1980', 20, 800),
 ('1981', 10, 7450),
 ('1981', 20, 5975),
 ('1981', 30, 9400),
 ('1982', 10, 1300),
 ('1982', 20, 3000),
 ('1983', 20, 1100),
 (None, None, 29025)]

문제 202. 입사한 년도(4자리), 부서번호, 입사한 년도(4자리)별 부서번호별 토탈월급을 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;중간중간 입사한 년도(4자리)별 토탈월급이 출력되게 하고  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;맨 아래에 전체 토탈월급이 출력되게 하시오

In [140]:
%%sql

select to_char(hiredate, 'YYYY') as "hiredate", deptno, sum(sal)
    from emp
    group by grouping sets( (to_char(hiredate, 'YYYY'), deptno), (to_char(hiredate, 'YYYY')), () )
    order by to_char(hiredate, 'YYYY'), deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('1980', 20, 800),
 ('1980', None, 800),
 ('1981', 10, 7450),
 ('1981', 20, 5975),
 ('1981', 30, 9400),
 ('1981', None, 22825),
 ('1982', 10, 1300),
 ('1982', 20, 3000),
 ('1982', None, 4300),
 ('1983', 20, 1100),
 ('1983', None, 1100),
 (None, None, 29025)]